[
    {
        "title":"What Tucker Carlson Leaves Behind as He Is Shown the Door",
        "text":"In the days after the 2020 election, the Fox host Tucker Carlson sent an anxious text message to one of his producers. Fox viewers were furious about the network’s decision to call Arizona for Joseph R. Biden Jr.The defeated president, Donald J. Trump, was eagerly stoking their anger. As Mr. Carlson and his producer batted around ideas for a new Carlson podcast — one that might help win back the audience most angry about Mr. Trump’s defeat — they saw both opportunity and peril in the moment.",
        "date":"2023-04-15 18:30",
        "importance": "1"
    }
    ,
    {
        "title":"Biden Plans an Election Bid That Will Be More Complicated the 2nd Time Around",
        "text":"WASHINGTON — President Biden is set to ask for another four years in office as soon as Tuesday, four years after declaring his 2020 candidacy in the hopes of preventing President Donald J. Trump from “forever and fundamentally” altering the character of the United States.People close to Mr. Biden expect him to announce his re-election bid in a video, much the way he entered the last campaign, when he used the same format to urge Americans to embrace a different vision for the country and to “remember who we are.”",
        "date":"2024-04-15 10:30",
        "importance": "1"
        
    }
    ,
    {
        "title":"Ukraine's Spring Offensive Comes With Immense Stakes for Future of the War",
        "text":"WASHINGTON — Ukraine is preparing to launch a counteroffensive against Russian forces as early as next month, American officials say, in the face of immense risks: Without a decisive victory, Western support for Ukraine could weaken, and Kyiv could come under increasing pressure to enter serious negotiations to end or freeze the conflict.American and NATO allies have supplied Ukraine with extensive artillery and ammunition for the upcoming battle, and officials now say they are hopeful the supplies will last — a change from two months ago when weapons were only trickling in and U.S. officials were worried that the supplies might run out.",
        "date":"2023-04-15 12:30",
        "importance": "1"
    }
    ,
    {
        "title":"North Dakota Governor Signs Near-Total Abortion Ban",
        "text":"North Dakota became the latest state on Monday to enact a near-total ban on abortion, just one month after the State Supreme Court temporarily blocked a similar ban from taking effect. Under the new law, an abortion in the case of rape or incest would be permissible only in the first six weeks of pregnancy, a time when most women have not yet realized they are pregnant. Abortion is permitted without gestational limits if terminating a pregnancy can “prevent the death or a serious health risk” of the mother.",
        "date":"2023-04-25 14:26",
        "importance": "0"
    }

]